# Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

import os
os.system('cls')

# s = int(input('Введите сумму x + y = s: '))
# p = int(input('Введите произведение x * y = s: '))

# x = 0
# y = 0

# for i in range(1, s//2 + 1):
#     if i * (s - i ) == p:
#         x = i
#         y = s - i
# print({x}, {y})


x = int(input())
y = int(input())

for i in range(x):
    for j in range(y):
        if x == i + j and y == i *j:
            print(i, j)